//  1.1 Напишите программу, которая на вход
//принимает два числа и выдаёт, какое число большее, а
//какое меньшее. 


// Console.WriteLine("введите число a");
//  int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("введите число b");
//  int b = Convert.ToInt32(Console.ReadLine());

// if( a > b )
// {
//     Console.WriteLine (" max a");
//     Console.WriteLine (" min b");
// }

// else
// {
//     Console.WriteLine (" max b");
//     Console.WriteLine (" min a");
// }


// // 1.2 Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// Console.WriteLine("введите первое число");
//  int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("введите второе число");
//  int b = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("введите третье число");
//  int c = Convert.ToInt32(Console.ReadLine());
//  int max= 0;

// if (a>max)
//    {
//     max=a;
//    } 
// if (b>max)
//     {
//      max=b ;
//     }
// if (c>max)
//     {
//      max=c;
//     }
// Console.Write( "max = ");
// Console.WriteLine (max);

// 1.3 Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// Console.WriteLine("введите число");
// int a = Convert.ToInt32(Console.ReadLine());
// if (a%2==1)
//     {
//     Console.WriteLine ("нечетное число");
//     }
// else
// {
//     Console.WriteLine ("четное число");
// }

// 1.4 Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.