
// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает,
//  что третьей цифры нет.
// 445 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6


    // Console.WriteLine("напишите число");
    // string text = Console.ReadLine();
    // if (text.Length<3)
    // //Console.WriteLine("третьей цифры нет");
    // Console.WriteLine(text + " -> " + "третьей цифры нет");
    // else
    // //Console.WriteLine("третья цифра заданного числа  " + text[2]);
    // Console.WriteLine(text + " -> " + text[2]);




// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine("напишите цифру обозначающую день недели 1..7");
// int q = Convert.ToInt32(Console.ReadLine());

// if (q >=6) Console.WriteLine("этот день выходной");
// else
// {
//     Console.WriteLine("этот день рабочий");
// }
//------------------------------------------------------------
// Console.WriteLine("напишите цифру обозначающую день недели 1..7");
// int z = Convert.ToInt32(Console.ReadLine());

// if (z >=1 && z <= 7) {
//     if (z >= 6) Console.WriteLine("этот день выходной");
//     else Console.WriteLine("этот рабочий день");
// } 
// else
// {
//     Console.WriteLine("Вы ошиблись с вводом числа, оно выходит за пределы 1..7");
// }
    

